In [117]:
family={
    "first":["laxmi","mahesh","sheshnath","sunil"],
    "last":["bhandari","bhandari","bhandari","bhandar"],
    "email":["lx@gmail.com","ma@gmail.com","sh@gmail.com","su@gmail.com"]
}

In [118]:
import pandas as pd

In [119]:
df=pd.DataFrame(family)

In [120]:
df

       first      last         email
0      laxmi  bhandari  lx@gmail.com
1     mahesh  bhandari  ma@gmail.com
2  sheshnath  bhandari  sh@gmail.com
3      sunil   bhandar  su@gmail.com

In [121]:
type[df["email"]]

type[0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object]

In [122]:
df.email

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [123]:
df['email']

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [124]:
df[['first','last',"email"]]

       first      last         email
0      laxmi  bhandari  lx@gmail.com
1     mahesh  bhandari  ma@gmail.com
2  sheshnath  bhandari  sh@gmail.com
3      sunil   bhandar  su@gmail.com

In [125]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [126]:
df.iloc[0]

first           laxmi
last         bhandari
email    lx@gmail.com
Name: 0, dtype: object

In [127]:
df.iloc[[0,1],0]

0     laxmi
1    mahesh
Name: first, dtype: object

In [128]:
df.loc[[0,1],"first"]

0     laxmi
1    mahesh
Name: first, dtype: object

In [129]:
df.set_index('email')

                  first      last
email
lx@gmail.com      laxmi  bhandari
ma@gmail.com     mahesh  bhandari
sh@gmail.com  sheshnath  bhandari
su@gmail.com      sunil   bhandar

In [130]:
df

       first      last         email
0      laxmi  bhandari  lx@gmail.com
1     mahesh  bhandari  ma@gmail.com
2  sheshnath  bhandari  sh@gmail.com
3      sunil   bhandar  su@gmail.com

In [131]:
df.set_index('email',inplace=True)

In [132]:
df

                  first      last
email
lx@gmail.com      laxmi  bhandari
ma@gmail.com     mahesh  bhandari
sh@gmail.com  sheshnath  bhandari
su@gmail.com      sunil   bhandar

In [133]:
df.loc['su@gmail.com','last']

'bhandar'

In [134]:
df.loc['lx@gmail.com']

first       laxmi
last     bhandari
Name: lx@gmail.com, dtype: object

In [135]:
df.iloc[0]

first       laxmi
last     bhandari
Name: lx@gmail.com, dtype: object

In [136]:
df.reset_index(inplace=True)

In [137]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [138]:

#now using flitering the data to use what we want.

In [139]:
df['last']=='bhandari'

0     True
1     True
2     True
3    False
Name: last, dtype: bool

In [140]:
#here it returns only the boolen value so it is difficult for us to see,know so we use filter.

In [141]:
filt=(df['last']=='bhandari')

In [142]:
df[filt]

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari

In [143]:
#or we can write it as follow
df.loc[filt]

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari

In [144]:
#we can run it as follow also
df[df['last']=="bhandari"]

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari

In [145]:
#reson of perfering loc is that we can grab specific columns that we want as well

In [146]:
df.loc[filt,'email']

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
Name: email, dtype: object

In [147]:
#like in other langauge we can use operators here to filter thegiven data/.

In [148]:
filt=(df['last']=='bhandari')&(df['first']=='laxmi')

In [149]:
df.loc[filt,'email']

0    lx@gmail.com
Name: email, dtype: object

In [150]:
filt=(df['last']=="bhandari")|(df['last']=='bhandar')

In [151]:
df.loc[filt,'email']

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [152]:
filt=(df['last']=='bhandari')&(df['first']=='laxmi')

In [153]:
df.loc[~filt,"email"]

1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [154]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [155]:
#updating the rows and columns
#modifying data with in the dataframe

In [156]:
#updating column first
#multiple rows

In [157]:
df.columns=['email','first_name','last_name']
#it will change the name of the columns

In [158]:
df

          email first_name last_name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [159]:
#using list comprensive

In [160]:
df.columns=[x.upper() for x in df.columns]
#it will change the column name into uppercase

In [161]:
df

          EMAIL FIRST_NAME LAST_NAME
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [162]:
df.columns=[x.lower() for x in df.columns]
#it will again change the column in the lower case

In [163]:
df

          email first_name last_name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [164]:
df.columns=df.columns.str.replace('_',' ')
#it will change every _ in space in the column as shown above

In [165]:
df

          email first name last name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [166]:
df.columns=df.columns.str.replace(' ','_')
df

          email first_name last_name
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [167]:
#changing some columns
#here the dictionary comes in the picture

In [168]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [169]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [170]:
#changing or updating the rows
#firstly changing the multiple rows

In [171]:
df.loc[2]

email    sh@gmail.com
first       sheshnath
last         bhandari
Name: 2, dtype: object

In [172]:
df.loc[2]=['SN@gmail.com','SN','Bhandari']

In [173]:
df

          email   first      last
0  lx@gmail.com   laxmi  bhandari
1  ma@gmail.com  mahesh  bhandari
2  SN@gmail.com      SN  Bhandari
3  su@gmail.com   sunil   bhandar

In [174]:
#df.loc[2]=['Sh@gmail.com',"sn"]

In [175]:
#NOTE

In [176]:
#df.loc[2]=['SN@gmail.com','SN','Bhandari']
#IF we use this to change the rfows and i we have to change one word but there are multiple rows than it really SUCKS.
#So we usethe following Insted

In [177]:
df.loc[2,['first','email']] = ['Sheshnath','sh@gmail.com']

In [178]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  Sheshnath  Bhandari
3  su@gmail.com      sunil   bhandar

In [179]:
#changing the one word in the row

In [180]:
df.loc[2,'first']='sheshnath'

In [181]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  Bhandari
3  su@gmail.com      sunil   bhandar

In [182]:
#.at is similar to .loc

In [183]:
df.at[2,'last']='bhandari'

In [184]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [185]:
#changing the multiple ROW

In [186]:
df['email'].str.lower()

0    lx@gmail.com
1    ma@gmail.com
2    sh@gmail.com
3    su@gmail.com
Name: email, dtype: object

In [187]:
df['email'].str.upper()

0    LX@GMAIL.COM
1    MA@GMAIL.COM
2    SH@GMAIL.COM
3    SU@GMAIL.COM
Name: email, dtype: object

In [188]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [189]:
df['email']=df['email'].str.upper()

In [190]:
df

          email      first      last
0  LX@GMAIL.COM      laxmi  bhandari
1  MA@GMAIL.COM     mahesh  bhandari
2  SH@GMAIL.COM  sheshnath  bhandari
3  SU@GMAIL.COM      sunil   bhandar

In [191]:
df

          email      first      last
0  LX@GMAIL.COM      laxmi  bhandari
1  MA@GMAIL.COM     mahesh  bhandari
2  SH@GMAIL.COM  sheshnath  bhandari
3  SU@GMAIL.COM      sunil   bhandar

In [192]:
#there are 4 method to change rows and they are
#apply
#map
#applymap
#replace

In [193]:
#APPLY
#used for calling a function on our value
#it can work in data frame and on series both.

In [194]:
#how apply works on series

In [195]:
df['email'].apply(len)

0    12
1    12
2    12
3    12
Name: email, dtype: int64

In [196]:
#creating the function and calling that function

In [197]:
def update_email (email):
    return email.lower()

In [198]:
df['email']=df['email'].apply(update_email)

In [199]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [200]:
#how apply works on dataframe

In [201]:
df.apply(len)

email    4
first    4
last     4
dtype: int64

In [202]:
df.apply(len,axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [203]:
df.apply(pd.Series.min)

email    lx@gmail.com
first           laxmi
last          bhandar
dtype: object

In [204]:
# APPLY MAPS

In [205]:
#APPLY MAP only works on dataframe

In [206]:
df.applymap(len)

   email  first  last
0     12      5     8
1     12      6     8
2     12      9     8
3     12      5     7

In [207]:
df.applymap(str.upper)

          email      first      last
0  LX@GMAIL.COM      LAXMI  BHANDARI
1  MA@GMAIL.COM     MAHESH  BHANDARI
2  SH@GMAIL.COM  SHESHNATH  BHANDARI
3  SU@GMAIL.COM      SUNIL   BHANDAR

In [208]:
df.applymap(str.lower)

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [209]:
#MAP

In [210]:
#map is used to substitute each values in a series with another value.
#here the dictionary comes into the picture.

In [211]:
df['first'].map({'sunil':'men'})

0    NaN
1    NaN
2    NaN
3    men
Name: first, dtype: object

In [212]:
#the drawback of using map is that if we donot change the any word it will not be viewed same,
#rather  it will show NaN

In [213]:
#so REPLACE comes into the picture.

In [214]:
#REPLACE

In [215]:
df['first'].replace({'men':'sunil'})

0        laxmi
1       mahesh
2    sheshnath
3        sunil
Name: first, dtype: object

In [216]:
df

          email      first      last
0  lx@gmail.com      laxmi  bhandari
1  ma@gmail.com     mahesh  bhandari
2  sh@gmail.com  sheshnath  bhandari
3  su@gmail.com      sunil   bhandar

In [217]:
#Add and remove rows and columns from dataframe

In [218]:
#for columns
#combining columns

In [219]:
df['first']+' '+df['last']

0        laxmi bhandari
1       mahesh bhandari
2    sheshnath bhandari
3         sunil bhandar
dtype: object

In [221]:
#Adding Columns

In [223]:
df['Full_name']=df['first']+' '+df['last']

In [224]:
df

          email      first      last           Full_name
0  lx@gmail.com      laxmi  bhandari      laxmi bhandari
1  ma@gmail.com     mahesh  bhandari     mahesh bhandari
2  sh@gmail.com  sheshnath  bhandari  sheshnath bhandari
3  su@gmail.com      sunil   bhandar       sunil bhandar

In [232]:
#removing columns
#drop is used to remove.

In [242]:
df.drop(columns=['first','last'],inplace=True)

In [233]:
df

          email           Full_name
0  lx@gmail.com      laxmi bhandari
1  ma@gmail.com     mahesh bhandari
2  sh@gmail.com  sheshnath bhandari
3  su@gmail.com       sunil bhandar

In [236]:
#string split

In [237]:
df['Full_name'].str.split(' ')

0        [laxmi, bhandari]
1       [mahesh, bhandari]
2    [sheshnath, bhandari]
3         [sunil, bhandar]
Name: Full_name, dtype: object

In [238]:
df['Full_name'].str.split(' ',expand=True)

           0         1
0      laxmi  bhandari
1     mahesh  bhandari
2  sheshnath  bhandari
3      sunil   bhandar

In [239]:
df[['first','last']]=df['Full_name'].str.split(' ',expand=True)

In [240]:
df

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar

In [241]:
df

          email           Full_name      first      last
0  lx@gmail.com      laxmi bhandari      laxmi  bhandari
1  ma@gmail.com     mahesh bhandari     mahesh  bhandari
2  sh@gmail.com  sheshnath bhandari  sheshnath  bhandari
3  su@gmail.com       sunil bhandar      sunil   bhandar

In [253]:
#now its turn for rows
#adding single rows
#for adding the single rows the concat is used 
df

          email           Full_name
0  lx@gmail.com      laxmi bhandari
1  ma@gmail.com     mahesh bhandari
2  sh@gmail.com  sheshnath bhandari
3  su@gmail.com       sunil bhandar

In [254]:
df.append({'Full_name':'Neymar Jr'},ignore_index=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_8460\3701847585.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'Full_name':'Neymar Jr'},ignore_index=True)

          email           Full_name
0  lx@gmail.com      laxmi bhandari
1  ma@gmail.com     mahesh bhandari
2  sh@gmail.com  sheshnath bhandari
3  su@gmail.com       sunil bhandar
4           NaN           Neymar Jr

In [255]:
#Modifying dataframe

In [256]:
#creating an another dictionary

In [258]:
people={
    'first':['Mice',"Jerry"],
    'last':['Trump','Hennry'],
    'email':['m@gmail.com','J@gmail.com']
}

In [261]:
df2=pd.DataFrame(people)

In [262]:
df2

   first    last        email
0   Mice   Trump  m@gmail.com
1  Jerry  Hennry  J@gmail.com

In [263]:
#combining or appending the dataframe

In [264]:
df.append(df2,ignore_index=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_8460\2741153526.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True)

          email           Full_name  first    last
0  lx@gmail.com      laxmi bhandari    NaN     NaN
1  ma@gmail.com     mahesh bhandari    NaN     NaN
2  sh@gmail.com  sheshnath bhandari    NaN     NaN
3  su@gmail.com       sunil bhandar    NaN     NaN
4   m@gmail.com                 NaN   Mice   Trump
5   J@gmail.com                 NaN  Jerry  Hennry

In [265]:
#here inplace cannot be used so

In [266]:
df=df.append(df2,ignore_index=True)

C:\Users\asus\AppData\Local\Temp\ipykernel_8460\2482205262.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(df2,ignore_index=True)

In [267]:
df

          email           Full_name  first    last
0  lx@gmail.com      laxmi bhandari    NaN     NaN
1  ma@gmail.com     mahesh bhandari    NaN     NaN
2  sh@gmail.com  sheshnath bhandari    NaN     NaN
3  su@gmail.com       sunil bhandar    NaN     NaN
4   m@gmail.com                 NaN   Mice   Trump
5   J@gmail.com                 NaN  Jerry  Hennry

In [273]:
#Removinf the rows
#drop is used to remove the rows

In [295]:
#df.drop(index=5)